// Инструкции - это синтаксические конструкции и команды которые выполняют действия, проще говоря, то через что мы общаемся с js
// Инструкции отделяются с помощью ";"
// Инструкции пишутся с новой строки
"use strict";
// Эта директива включает строгий режим, где весь код работает в современном режиме. Можно так же поставить в начале определенной функции, и строгий режим применится только к этой функции, но обычно эту директиву ставят просто в начале файла. Способа отключить эту директиву нет. Если она не в функции, над ней не должно быть ничего кроме коментариев. Директиву внутри функции не все браузеры поддерживают.
